g0dmao/FreeRTOS_transplant_to_stm32/RTOS/include/FreeRTOSConfig.h
/* Set configSUPPORT_STATIC_ALLOCATION to 1 to include FreeRTOS API functions
 * that create FreeRTOS objects (tasks, queues, etc.) using statically allocated
 * memory in the build.  Set to 0 to exclude the ability to create statically
 * allocated objects from the build.  Defaults to 0 if left undefined.  See
 * https://www.freertos.org/Static_Vs_Dynamic_Memory_Allocation.html. */
 /*启用静态内存分配：1 启用*/
#define configSUPPORT_STATIC_ALLOCATION              0

/* Set configSUPPORT_DYNAMIC_ALLOCATION to 1 to include FreeRTOS API functions
 * that create FreeRTOS objects (tasks, queues, etc.) using dynamically allocated
 * memory in the build.  Set to 0 to exclude the ability to create dynamically
 * allocated objects from the build.  Defaults to 1 if left undefined.  See
 * https://www.freertos.org/Static_Vs_Dynamic_Memory_Allocation.html. */
 /*启用RTOS动态内存分配：1 启用，从FreeRTOS堆中自动分配*/
#define configSUPPORT_DYNAMIC_ALLOCATION             1

/* Sets the total size of the FreeRTOS heap, in bytes, when heap_1.c, heap_2.c
 * or heap_4.c are included in the build.  This value is defaulted to 4096 bytes but
 * it must be tailored to each application.  Note the heap will appear in the .bss
 * section.  See https://www.freertos.org/a00111.html. */
 /*用于RTOS动态内存分配的堆的大小,可分配内存 F1 RAM 20K*/
#define configTOTAL_HEAP_SIZE                       (10*1024)

/* Set configAPPLICATION_ALLOCATED_HEAP to 1 to have the application allocate
 * the array used as the FreeRTOS heap.  Set to 0 to have the linker allocate the
 * array used as the FreeRTOS heap.  Defaults to 0 if left undefined. */
/*0 RTOS的内存堆由RTOS自己声明 1 由编写者声明，具体声明方法见文档*/
#define configAPPLICATION_ALLOCATED_HEAP             0

/* Set configSTACK_ALLOCATION_FROM_SEPARATE_HEAP to 1 to have task stacks
 * allocated from somewhere other than the FreeRTOS heap.  This is useful if you
 * want to ensure stacks are held in fast memory.  Set to 0 to have task stacks
 * come from the standard FreeRTOS heap.  The application writer must provide
 * implementations for pvPortMallocStack() and vPortFreeStack() if set to 1.
 * Defaults to 0 if left undefined. */
/*如果 configSTACK_ALLOCATION_FROM_SEPARATE_HEAP 设置为 1， 
则使用 xTaskCreate 或 xTaskCreateRestricted API 创建的任务堆栈 将分别通过 pvPortMallocStack和 
vPortFreeStack函数进行分配和释放。用户需要提供 pvPortMallocStack 和 vPortFreeStack
函数的线程安全实现。 如此一来，用户便可以从内存的另一个区域 （可能是与 FreeRTOS 堆不同的另一个堆）为任务分配堆栈。
具体实现见文档*/
#define configSTACK_ALLOCATION_FROM_SEPARATE_HEAP    0

/* Set configENABLE_HEAP_PROTECTOR to 1 to enable bounds checking and obfuscation
 * to internal heap block pointers in heap_4.c and heap_5.c to help catch pointer
 * corruptions. Defaults to 0 if left undefined. */
/*堆保护器？？关于指针，边界检查啥的，没搞明白，默认*/
#define configENABLE_HEAP_PROTECTOR                  0

/******************************************************************************/
/* Interrupt nesting behaviour configuration. *********************************/
/******************************************************************************/

/* configKERNEL_INTERRUPT_PRIORITY sets the priority of the tick and context
 * switch performing interrupts.  Not supported by all FreeRTOS ports.  See
 * https://www.freertos.org/RTOS-Cortex-M3-M4.html for information specific to
 * ARM Cortex-M devices. */
/*此定义与下一个定义可联合作用。RTOS内核自身使用的中断优先级，例如任务切换时产生的中断，
如果仅使用该定义而不使用下面的另一个定义，那么需要调用RTOS API的中断必须和内核中断同一优先级，
好处是不需要调用API的中断可以立刻响应而不会因为内核中断延迟（硬件支持的情况下）。该定义应设置为最低优先级。*/
#define configKERNEL_INTERRUPT_PRIORITY          ( 15 << (8 - 4) )

/* configMAX_SYSCALL_INTERRUPT_PRIORITY sets the interrupt priority above which
 * FreeRTOS API calls must not be made.  Interrupts above this priority are never
 * disabled, so never delayed by RTOS activity.  The default value is set to the
 * highest interrupt priority (0).  Not supported by all FreeRTOS ports.
 * See https://www.freertos.org/RTOS-Cortex-M3-M4.html for information specific to
 * ARM Cortex-M devices. */
/*此定义与上一个定义可联合作用。该定义设置了可以调用中断安全的RTOS API的最高中断优先级，假设设置为4，也就是说，
逻辑优先级不大于4的中断可以使用API函数，同时，这些中断也可能因为内核中断而不会立刻执行，而逻辑优先级高于4且不调
用API的中断可以立即执行。与上一个定义联合作用后，任何不调用API的中断都可以打断内核中断，如果中断需要调用API，
那么它可以在逻辑优先级不大于4的情况下运行，nb！！需要注意的是，在Cortex-M内核中，低逻辑优先级是高数字优先级，也
就是说如果中断分组为4bit抢占优先级，共16个优先级（FreeRTOS建议这样做），5~15优先级是可以调用API函数的
*/
/*直接写4似乎会有断言错误，是因为在断言中把这个数和0xF0进行了与操作，不知道为啥，这里用正点原子的解决办法，把优先级左移(8-中断分组4bit)*/
#define configMAX_SYSCALL_INTERRUPT_PRIORITY     ( 4 << (8 - 4) )

/* Another name for configMAX_SYSCALL_INTERRUPT_PRIORITY - the name used depends
 * on the FreeRTOS port. */
/*功能和上面的那个相同，只是名称不同*/
//#define configMAX_API_CALL_INTERRUPT_PRIORITY    0

/******************************************************************************/
/* Hook and callback function related definitions. ****************************/
/******************************************************************************/

/* Set the following configUSE_* constants to 1 to include the named hook
 * functionality in the build.  Set to 0 to exclude the hook functionality from the
 * build.  The application writer is responsible for providing the hook function
 * for any set to 1.  See https://www.freertos.org/a00016.html. */
 /*名字已说明一切，不再赘述*/
#define configUSE_IDLE_HOOK                   0
#define configUSE_TICK_HOOK                   0
/*如果 configUSE_MALLOC_FAILED_HOOK设置为 1，则应用程序必须定义 malloc()失败钩子函数。如果 configUSE_MALLOC_FAILED_HOOK设置为 0， 即使定义了 
malloc()失败钩子函数，也不会调用该函数。 malloc()失败钩子函数必须具有如下所示的名称和原型。*/
#define configUSE_MALLOC_FAILED_HOOK          0
/*当 RTOS 守护进程任务（也称为定时器服务任务） 首次执行时，将只调用一次钩子函数。任何需要 RTOS 运行的应用程序初始化代码均可放在钩子函数中。*/
#define configUSE_DAEMON_TASK_STARTUP_HOOK    0

/* Set configUSE_SB_COMPLETED_CALLBACK to 1 to have send and receive completed
 * callbacks for each instance of a stream buffer or message buffer. When the
 * option is set to 1, APIs xStreamBufferCreateWithCallback() and
 * xStreamBufferCreateStaticWithCallback() (and likewise APIs for message
 * buffer) can be used to create a stream buffer or message buffer instance
 * with application provided callbacks. Defaults to 0 if left undefined. */
/*设置 configUSE_SB_COMPLETED_CALLBACK()会将 xStreamBufferCreateWithCallback()和 xStreamBufferCreateStaticWithCallback()
（及其消息缓冲区的等效函数）包含在构建中。使用这些函数创建的流缓冲区和消息缓冲区可以拥有自己独特的发送完成和接收完成回调， 而使用 
xStreamBufferCreate()和xStreamBufferCreateStatic()（及其消息缓冲区的等效函数）创建的流缓冲区和消息缓冲区则共享由 sbSEND_COMPLETED()
和sbRECEVE_COMPLETED()宏定义的回调。默认为0*/
#define configUSE_SB_COMPLETED_CALLBACK       0

/* Set configCHECK_FOR_STACK_OVERFLOW to 1 or 2 for FreeRTOS to check for a
 * stack overflow at the time of a context switch.  Set to 0 to not look for a
 * stack overflow.  If configCHECK_FOR_STACK_OVERFLOW is 1 then the check only
 * looks for the stack pointer being out of bounds when a task's context is saved
 * to its stack - this is fast but somewhat ineffective.  If
 * configCHECK_FOR_STACK_OVERFLOW is 2 then the check looks for a pattern written
 * to the end of a task's stack having been overwritten.  This is slower, but will
 * catch most (but not all) stack overflows.  The application writer must provide
 * the stack overflow callback when configCHECK_FOR_STACK_OVERFLOW is set to 1.
 * See https://www.freertos.org/Stacks-and-stack-overflow-checking.html  Defaults
 * to 0 if left undefined. */
/*堆栈溢出检查会增加上下文切换的开销，因此建议只在开发或测试阶段使用此检查。*/
#define configCHECK_FOR_STACK_OVERFLOW        2

/******************************************************************************/
/* Run time and task stats gathering related definitions. *********************/
/******************************************************************************/

/* Set configGENERATE_RUN_TIME_STATS to 1 to have FreeRTOS collect data on the
 * processing time used by each task.  Set to 0 to not collect the data.  The
 * application writer needs to provide a clock source if set to 1.  Defaults to 0
 * if left undefined.  See https://www.freertos.org/rtos-run-time-stats.html. */
 /*是否收集程序运行时间：1 启用，用户需要提供时钟源*/
#define configGENERATE_RUN_TIME_STATS           1
#ifdef configGENERATE_RUN_TIME_STATS
  extern void ConfigureTimeForRunTimeStats(void);
  extern uint32_t FreeRTOSRunTimeTicks;
  #define portCONFIGURE_TIMER_FOR_RUN_TIME_STATS() ConfigureTimeForRunTimeStats()  
  #define portGET_RUN_TIME_COUNTER_VALUE()         FreeRTOSRunTimeTicks
#endif

/* Set configUSE_TRACE_FACILITY to include additional task structure members
 * are used by trace and visualisation functions and tools.  Set to 0 to exclude
 * the additional information from the structures. Defaults to 0 if left
 * undefined. */
/*如果希望包含其他任务结构体成员和函数以协助执行可视化和跟踪，请将其设置为 1。*/
#define configUSE_TRACE_FACILITY                1

/* Set to 1 to include the vTaskList() and vTaskGetRunTimeStats() functions in
 * the build.  Set to 0 to exclude these functions from the build.  These two
 * functions introduce a dependency on string formatting functions that would
 * otherwise not exist - hence they are kept separate.  Defaults to 0 if left
 * undefined. */
/*将 
configUSE_TRACE_FACILITY和 configUSE_STATS_FORMATTING_FUNCTIONS设置为 1， 即可在构建中包含 vTaskList() 和 vTaskGetRunTimeStats() 函数。
如果将上述其中任意一个函数设置为 0，则可从构建中忽略 vTaskList()和 vTaskGetRunTimeStates()*/
#define configUSE_STATS_FORMATTING_FUNCTIONS    1

/******************************************************************************/
/* Co-routine related definitions. ********************************************/
/******************************************************************************/
/*协程功能，不使用*/
/* Set configUSE_CO_ROUTINES to 1 to include co-routine functionality in the
 * build, or 0 to omit co-routine functionality from the build. To include
 * co-routines, croutine.c must be included in the project. Defaults to 0 if left
 * undefined. */
#define configUSE_CO_ROUTINES              0

/* configMAX_CO_ROUTINE_PRIORITIES defines the number of priorities available
 * to the application co-routines. Any number of co-routines can share the same
 * priority. Defaults to 0 if left undefined. */
#define configMAX_CO_ROUTINE_PRIORITIES    1

/******************************************************************************/
/* Debugging assistance. ******************************************************/
/******************************************************************************/

/* configASSERT() has the same semantics as the standard C assert().  It can
 * either be defined to take an action when the assertion fails, or not defined
 * at all (i.e. comment out or delete the definitions) to completely remove
 * assertions.  configASSERT() can be defined to anything you want, for example
 * you can call a function if an assert fails that passes the filename and line
 * number of the failing assert (for example, "vAssertCalled( __FILE__, __LINE__ )"
 * or it can simple disable interrupts and sit in a loop to halt all execution
 * on the failing line for viewing in a debugger. */
/*应用程序足够稳定时，只需注释掉 configASSERT()定义 （在 FreeRTOSConfig.h 中），即可消除额外的开销。
如果在调试器的控制下运行 FreeRTOS，则可以将 configASSERT()定义为仅禁用中断并进入循环，
这会导致代码停在未能通过断言测试的那一行，暂停调试器即可立即转到出错行，方便查看失败的原因*/
#define configASSERT( x )         \
    if( ( x ) == 0 )              \
    {                             \
        taskDISABLE_INTERRUPTS(); \
        for( ; ; )                \
        ;                         \
    }

/******************************************************************************/
/* FreeRTOS MPU specific definitions. *****************************************/
/******************************************************************************/

/* If configINCLUDE_APPLICATION_DEFINED_PRIVILEGED_FUNCTIONS is set to 1 then
 * the application writer can provide functions that execute in privileged mode.
 * See: https://www.freertos.org/a00110.html#configINCLUDE_APPLICATION_DEFINED_PRIVILEGED_FUNCTIONS
 * Defaults to 0 if left undefined.  Only used by the FreeRTOS Cortex-M MPU ports,
 * not the standard ARMv7-M Cortex-M port. */
#define configINCLUDE_APPLICATION_DEFINED_PRIVILEGED_FUNCTIONS    0

